{
    "empireinfo": [
        {
            "name": "United Sol Federation",
            "lore": "fdsf",
            "special": "estset"
        },
        {
            "name": "Zelvan Star Dominion",
            "ethics": "Test",
            "lore": "Testjjqwewqqew",
            "special": "weqweqwe",
            "stats": "Test"
        },
        {
            "name": "Yondarim Directorate",
            "civics": "Test4",
            "ethics": "Test3",
            "lore": "Test1eqwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww",
            "special": "Test5qweeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee",
            "stats": "Test2"
        },
        {
            "name": "Ix'Idar Collective",
            "lore": "erwrwe"
        },
        {
            "name": "Baanthurian League",
            "civics": "wer",
            "ethics": "e222",
            "lore": "ewrweree",
            "special": "werwer",
            "stats": "fewfewe233232"
        },
        {
            "name": "eqw",
            "lore": "eeeewq"
        },
        {
            "name": "Fire_Warrior Empire",
            "ethics": "rtz",
            "lore": "TEST",
            "stats": "rtz"
        }
    ],
    "empires": [
        {
            "account": "Baanthurian League",
            "name": "Ix'Idar Collective"
        },
        {
            "account": "Baanthurian League",
            "name": "Baanthurian League"
        },
        {
            "account": "Yondarim Directorate",
            "name": "Yondarim Directorate"
        },
        {
            "account": "test",
            "name": "Fire_Warrior Empire"
        }
    ],
    "treaties": [
        {
            "id": "1753057058930",
            "content": "111qweqweqweqwqweqweeqwwwwaawwwe1111!\"ยง!!\"!ยง\"ยง",
            "owner": "Baanthurian League",
            "participants": [
                "Ix'Idar Collective"
            ],
            "status": "expired",
            "title": "!!112221Test Treaty "
        },
        {
            "id": "1753065853711",
            "content": "TETEST",
            "owner": "GameMaster",
            "participants": [
                "Ix'Idar Collective",
                "Baanthurian League",
                "Yondarim Directorate",
                "Fire_Warrior Empire"
            ],
            "status": "active",
            "title": "Test 2"
        },
        {
            "id": "1753067090749",
            "content": "etsetesteqwqwedd",
            "owner": "Fire_Warrior",
            "participants": [
                "Baanthurian League",
                "Fire_Warrior Empire",
                "Ix'Idar Collective",
                "Yondarim Directorate"
            ],
            "status": "discussion",
            "title": "TestWeqweqw"
        },
        {
            "id": "1753195978999",
            "content": "rew",
            "owner": "GameMaster",
            "participants": [
                "Baanthurian League",
                "Yondarim Directorate",
                "Fire_Warrior Empire"
            ],
            "status": "expired",
            "title": "TESTSET"
        },
        {
            "id": "1753198561384",
            "content": "ertert",
            "owner": "GameMaster",
            "participants": [
                "Yondarim Directorate",
                "eqw",
                "Baanthurian League",
                "Fire_Warrior Empire",
                "Ix'Idar Collective"
            ],
            "status": "broken",
            "title": "ewr"
        },
        {
            "id": "1753198731687",
            "content": "erw",
            "owner": "GameMaster",
            "participants": [
                "Ix'Idar Collective",
                "Baanthurian League"
            ],
            "status": "broken",
            "title": "test"
        },
        {
            "id": "1753218367670",
            "content": "6465",
            "owner": "Yondarim Directorate",
            "participants": [
                "Ix'Idar Collective",
                "Baanthurian League"
            ],
            "status": "expired",
            "title": "6556"
        },
        {
            "id": "1753226584386",
            "content": "rete",
            "owner": "Fire_Warrior",
            "participants": [
                "Ix'Idar Collective",
                "Baanthurian League",
                "Fire_Warrior Empire",
                "Yondarim Directorate"
            ],
            "status": "discussion",
            "title": "Test"
        },
        {
            "id": "1753227805005",
            "content": "eqwwwwwwwwwwwwww",
            "owner": "Yondarim Directorate",
            "participants": [
                "Baanthurian League",
                "Ix'Idar Collective"
            ],
            "status": "active",
            "title": "eqwwwwwwwwwweqwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww"
        },
        {
            "id": "1753406849196",
            "content": "Treaty Establishing the Galactic Confederate Systems - GCS Constitution\nPreamble\nWe, the representative star nations and civilizations of the galaxy, united in our commitment to peace, stability, and mutual prosperity, establish the Galactic Confederate Systems to foster cooperation, security, and advancement under GCS institutional oversight.\nArticle 1: Establishment\nThe Galactic Confederate Systems (Confederation) is established by [signees] and is open to those respecting its values and committed to its objectives.\nArticle 2: Objectives\nThe Confederation aims to promote galactic peace and stability, foster economic cooperation, ensure collective security, encourage scientific and technological innovation, protect cultural heritage, and facilitate free movement of goods, services, and citizens.\nArticle 3: Membership\nMembership is open to star nations meeting GCS criteria, requiring two-thirds GCS Council approval and consensus from existing members. Members operate under GCS institutional guidance.\nArticle 4: Withdrawal\nMembers retain the right to withdraw at any time and must notify the GCS Council and settle outstanding commitments.\nArticle 5: Institutions\nSection 1: The GCS Council\nThe GCS Council comprises representatives from each member state, with 10 per nation and 16 for the GCS Core. It enacts laws, approves budgets, oversees Confederation policies, and amends the Treaty. Elections are held every ten years, with sessions convening annually. The Council elects a Speaker for a five year term.\nSection 2: Government of Confederate Ministers\nThe Government of Confederate Ministers is elected by the GCS Council, representing all parliamentary factions. It leads executive functions, implements policies, and coordinates Confederation institutions. Headed by a Confederate Prime Minister, it is accountable to the GCS Council.\nSection 3: Other Institutions\nGalactic Assembly: Advises the GCS Council.\nGalactic Court of Justice: Interprets laws and resolves disputes.\nConfederate Security Force: Coordinates defense; members contribute at least 100 fleet units.\n\nArticle 6: Emergency Powers of the GCS Core\nIn situations deemed emergencies, including large-scale invasion, widespread civil unrest, catastrophic natural disasters, parliamentary deadlock, or the inability to form a government, the GCS Core Government shall have the authority to enact and implement policies, decisions, and regulations without the prior approval of the GCS Council, to ensure swift and effective response.\nThese emergency powers include, but are not limited to:\nPolicy Implementation: The GCS Core may implement policies and decisions that are deemed necessary for addressing the emergency, provided they do not conflict with existing laws or the Constitution.\nResource Allocation: The GCS Core may allocate and redirect resources, including fleet units, personnel, and supplies, to address the emergency, ensuring efficient and effective response.\nEmergency Measures: The GCS Core may take immediate action in response to the emergency, with such measures subject to post-hoc review by the GCS Council to ensure their necessity and proportionality.\nThe GCS Core shall inform the GCS Council of any actions taken under this authority at the earliest opportunity, providing a detailed account of the measures and their justification.\nThe GCS Council shall have the authority to review and, if necessary, revoke any actions taken by the GCS Core under this authority, by a two-thirds majority vote, if it deems the measures unnecessary, disproportionate, or in conflict with the interests of the Confederation.\nArticle 7: Economic Cooperation\nThe Confederation establishes a common economic framework to facilitate trade and development under GCS guidance.\nArticle 8: Collective Security\nMembers commit to mutual defense, with the Confederate Security Force coordinating efforts under GCS oversight.\nArticle 9: Scientific and Cultural Exchange\nThe Confederation promotes scientific research and cultural exchange to drive progress and celebrate diversity.\nArticle 10: Capital and Official Languages\nThe capital is on Basis, adjacent to the SDO headquarters, with multiple official languages recognized.\nArticle 11: Citizenship\nConfederation citizenship is established for nationals of member states, with defined rights and duties.\nArticle 12: Economic and Monetary Union\nAn economic and monetary union with the Galactic Credit as currency is managed by the Galactic Central Bank under GCS oversight.\nArticle 13: Common Foreign and Security Policy\nThe Confederation defines and implements a unified foreign and security policy to protect common values and interests.\nArticle 14: Area of Freedom, Security, and Justice\nThe Confederation ensures an area of freedom, security, and justice, respecting fundamental rights and legal traditions.\nArticle 15: Environmental Policy\nSustainable development and environmental protection are promoted across member states.\nArticle 16: Research and Technological Development\nThe Confederation strengthens scientific and technological bases to drive innovation and competitiveness.\nArticle 17: Energy and Transport Policy\nPolicies ensure energy security, efficiency, and the integration of transport states.\nArticle 18: Education and Public Health\nThe Confederation supports education and public health initiatives to foster understanding and well-being.\nArticle 19: Amendments\nAmendments require a two-thirds majority GCS Council agreement and approval by all member states.\nArticle 20: Ratification\nThis Treaty is ratified according to member states' constitutional requirements and enters into force upon deposit of ratification instruments with the GCS Council.\n\n\n\nIn witness whereof, the undersigned representatives have signed this Treaty.\n\n\nDone in unity and cooperation, on this day of galactic concord, under GCS institutional oversight.\n\n\n",
            "owner": "GameMaster",
            "participants": [
                "Ix'Idar Collective",
                "Baanthurian League",
                "Yondarim Directorate",
                "Fire_Warrior EPmpire",
                "test"
            ],
            "status": "discussion",
            "title": "GCS Establishment Treaty"
        }
    ]
}